Repository: 12dora/yamg
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# action.cancel
source: Cancel
zh_hans: 取消

# action.choose
source: Choose...
zh_hans: 选择...

# action.confirm
source: Confirm
zh_hans: 确认

# action.copy
source: Copy
zh_hans: 复制

# action.refresh
source: Refresh
zh_hans: 刷新

# action.reset
source: Reset
zh_hans: 重置

# action.save
source: Save
zh_hans: 保存

# application.detail.configuration_files
source: Configuration files
zh_hans: 配置文件

# application.detail.no_files
source: No configuration files were reported by Mackup.
zh_hans: Mackup 未报告配置文件。

# application.detail.placeholder
source: Select an application
zh_hans: 选择一个应用

# application.detail.placeholder.detail
source: Details are loaded with mackup show for the selected application.
zh_hans: 详情会通过 mackup show 为所选应用加载。

# applications.count %lld
source: %lld applications
zh_hans: %lld 个应用

# applications.empty
source: No applications found
zh_hans: 未找到应用

# applications.empty.detail
source: No .app bundles were found in the standard Applications folders.
zh_hans: 标准 Applications 文件夹中没有找到 .app 应用包。

# applications.failed
source: Could not load applications
zh_hans: 无法载入应用

# applications.sync_all
source: Sync All
zh_hans: 全选同步

# applications.sync_none
source: Sync None
zh_hans: 全不同步

# install.detail
source: Choose one install method. YAMG can run the selected installer or you can copy the command.
zh_hans: 请选择一种安装方式。YAMG 可以运行所选安装器，也可以复制命令手动执行。

# install.finished
source: Mackup install command finished.
zh_hans: Mackup 安装命令已完成。

source: Install method
zh_hans: 安装方式

# install.run
source: Install
zh_hans: 安装

# install.running %@
source: Running %@...
zh_hans: 正在运行 %@...

# install.title
source: Install Mackup
zh_hans: 安装 Mackup

# language.english
source: English
zh_hans: 英文

# language.simplified_chinese
source: Simplified Chinese
zh_hans: 简体中文

# language.system
source: System Default
zh_hans: 系统默认

# link_mode.acknowledge
source: I understand Link Mode can replace files with symlinks and is not the default backup path.
zh_hans: 我理解链接模式可能用符号链接替换文件，并且它不是默认备份路径。

# link_mode.command.install.detail
source: First-time link setup: copy into storage, delete originals, create symlinks.
zh_hans: 首次链接设置：复制到存储、删除原文件、创建符号链接。

# link_mode.command.link.detail
source: Recreate local symlinks from files already present in storage.
zh_hans: 根据存储中已有文件重新创建本地符号链接。

# link_mode.command.uninstall.detail
source: Remove Mackup-managed symlinks and copy files back to local paths.
zh_hans: 移除 Mackup 管理的符号链接，并把文件复制回本地路径。

# link_mode.confirm.install
source: Run mackup link install?
zh_hans: 运行 mackup link install？

# link_mode.confirm.link
source: Run mackup link?
zh_hans: 运行 mackup link？

# link_mode.confirm.uninstall
source: Run mackup link uninstall?
zh_hans: 运行 mackup link uninstall？

# link_mode.detail
source: Copy mode backup and restore remain the recommended MVP workflow. Link Mode only calls Mackup CLI link commands after explicit confirmation.
zh_hans: Copy mode 的备份和恢复仍是推荐的 MVP 工作流。链接模式只会在明确确认后调用 Mackup CLI link 命令。

# link_mode.guide.install.detail
source: Runs mackup link install. Mackup moves local files into storage and replaces them with links.
zh_hans: 运行 mackup link install。Mackup 会把本地文件移入存储并替换为链接。

# link_mode.guide.install.title
source: Install
zh_hans: 安装

# link_mode.guide.link.detail
source: Runs mackup link. Mackup links local paths to files already present in storage.
zh_hans: 运行 mackup link。Mackup 会把本地路径链接到存储中已有的文件。

# link_mode.guide.link.title
source: Link
zh_hans: 链接

# link_mode.guide.uninstall.detail
source: Runs mackup link uninstall. Mackup removes links and copies files back locally.
zh_hans: 运行 mackup link uninstall。Mackup 会移除链接并把文件复制回本机。

# link_mode.guide.uninstall.title
source: Uninstall
zh_hans: 卸载

# link_mode.high_risk
source: (High Risk)
zh_hans: （高风险）

# link_mode.idle
source: Select a Link Mode command and acknowledge the risk before continuing.
zh_hans: 请选择链接模式命令并确认风险后继续。

# link_mode.install
source: Install links
zh_hans: 安装链接

# link_mode.link
source: Link
zh_hans: 链接

# link_mode.operation
source: Operation
zh_hans: 操作

# link_mode.request
source: Prepare Link Mode command
zh_hans: 准备链接模式命令

# link_mode.uninstall
source: Uninstall links
zh_hans: 卸载链接

# link_mode.warning
source: Advanced high-risk Mackup Link Mode
zh_hans: 高级高风险 Mackup 链接模式

# logs.empty
source: No run history
zh_hans: 暂无运行记录

# logs.empty.detail
source: Run a backup or restore from the Dashboard to see output here.
zh_hans: 在仪表盘执行备份或还原后，输出记录将显示在这里。

# onboarding.cli.available %@
source: Available: Mackup %@
zh_hans: 可用：Mackup %@

# onboarding.cli.failed
source: Check failed
zh_hans: 检查失败

# onboarding.cli.invalid_version
source: Version output could not be parsed
zh_hans: 无法解析版本输出

# onboarding.cli.pending.detail
source: The app only checks the CLI; it does not run backup, restore, or link operations here.
zh_hans: 这里只检查 CLI，不会运行备份、恢复或链接操作。

# onboarding.cli.unavailable
source: Not installed or not found
zh_hans: 未安装或未找到

# onboarding.cli.unavailable.detail
source: Install Mackup with Homebrew or pipx, or set a custom CLI path later in Preferences.
zh_hans: 请通过 Homebrew 或 pipx 安装 Mackup，或稍后在偏好设置中指定 CLI 路径。

# onboarding.config.missing
source: Not found yet
zh_hans: 尚未找到

# onboarding.config.pending.detail
source: Default path: ~/.mackup.cfg
zh_hans: 默认路径：~/.mackup.cfg

# onboarding.config.present
source: Found
zh_hans: 已找到

# onboarding.config.status
source: Configuration file
zh_hans: 配置文件

# onboarding.subtitle
source: Check the Mackup CLI and default configuration before running any operation.
zh_hans: 在运行任何操作前检查 Mackup CLI 和默认配置。

# onboarding.title
source: Mackup readiness
zh_hans: Mackup 就绪状态

# operations.backup
source: Backup
zh_hans: 备份

# operations.confirm.backup
source: Run mackup backup?
zh_hans: 运行 mackup backup？

# operations.confirm.backup_dry_run
source: Run mackup backup --dry-run?
zh_hans: 运行 mackup backup --dry-run？

# operations.confirm.restore
source: Run mackup restore?
zh_hans: 运行 mackup restore？

# operations.confirm.restore_dry_run
source: Run mackup restore --dry-run?
zh_hans: 运行 mackup restore --dry-run？

# operations.dry_run
source: Dry run
zh_hans: 试运行

# operations.idle
source: Backup and restore run only after confirmation. Enable dry run when you want a preview.
zh_hans: 备份和恢复只会在确认后运行。需要预览时可启用试运行。

# operations.restore
source: Restore
zh_hans: 恢复

# operations.running.backup
source: Running backup...
zh_hans: 正在运行备份...

# operations.running.restore
source: Running restore...
zh_hans: 正在运行恢复...

# operations.status.failure
source: Failed
zh_hans: 失败

# operations.status.success
source: Succeeded
zh_hans: 成功

# operations.verbose
source: Verbose
zh_hans: 详细输出

# preferences.cli_path
source: Mackup CLI path
zh_hans: Mackup CLI 路径

# preferences.cli_path.detail
source: Optional absolute path to the mackup executable. Leave empty to auto-detect.
zh_hans: 可选的 mackup 可执行文件绝对路径。留空则自动检测。

# preferences.cli_path.placeholder
source: Auto-detect Mackup
zh_hans: 自动检测 Mackup

# preferences.config_path
source: Mackup config path
zh_hans: Mackup 配置路径

# preferences.config_path.detail
source: Optional path to .mackup.cfg. YAMG stores this preference in UserDefaults, not in the config file.
zh_hans: 可选的 .mackup.cfg 路径。YAMG 将该偏好保存到 UserDefaults，不写入配置文件。

# preferences.config_path.placeholder
source: Use default ~/.mackup.cfg
zh_hans: 使用默认 ~/.mackup.cfg

# preferences.language
source: Language
zh_hans: 语言

# preferences.reset_done
source: Preferences reset and matching .mackup.cfg files were deleted if they existed.
zh_hans: 偏好设置已重置，匹配的 .mackup.cfg 如存在已删除。

source: Preferences saved
zh_hans: 偏好设置已保存

# preferences.show_link_mode
source: Show Link Mode in sidebar
zh_hans: 在侧边栏显示链接模式

# scheduled_backup.installed
source: Scheduled backup is active
zh_hans: 定时备份已激活

# scheduled_backup.interval_days
source: Every %lld days
zh_hans: 每 %lld 天

# scheduled_backup.interval_hours
source: Every %lld hours
zh_hans: 每 %lld 小时

# scheduled_backup.interval_minutes
source: Every %lld minutes
zh_hans: 每 %lld 分钟

# scheduled_backup.saved
source: Scheduled backup settings saved
zh_hans: 定时备份设置已保存

# section.applications.subtitle
source: Installed Mac apps that Mackup supports. Toggle sync to write [applications_to_sync].
zh_hans: 本机已安装且 Mackup 支持的应用。开启同步即写入 [applications_to_sync]。

# section.applications.title
source: Applications
zh_hans: 应用

# section.dashboard.subtitle
source: Status, recent runs, and quick actions.
zh_hans: 状态、最近运行和快捷操作。

# section.dashboard.title
source: Dashboard
zh_hans: 仪表盘

# section.link_mode.subtitle
source: Advanced symlink operations for experienced Mackup users.
zh_hans: 面向有经验 Mackup 用户的高级符号链接操作。

# section.link_mode.title
source: Link Mode
zh_hans: 链接模式

# section.logs.subtitle
source: Streamed stdout and stderr history.
zh_hans: 流式 stdout 和 stderr 历史。

# section.logs.title
source: Logs
zh_hans: 日志

# section.preferences.subtitle
source: CLI path, config path, and UI preferences.
zh_hans: CLI 路径、配置路径和界面偏好设置。

# section.preferences.title
source: Preferences
zh_hans: 偏好设置

# setup.config.create
source: Create config file
zh_hans: 创建配置文件

# setup.config.detail
source: Choose an available storage provider and a Mackup folder before creating the config. Dropbox, Google Drive, and iCloud paths are detected with Mackup-compatible rules.
zh_hans: 创建配置前请选择可用的存储提供商和 Mackup 文件夹。Dropbox、Google Drive 与 iCloud 路径会按 Mackup 兼容规则自动检测。

# setup.config.saved %@
source: Saved %@
zh_hans: 已保存 %@

# setup.config.saving
source: Saving config file...
zh_hans: 正在保存配置文件...

# setup.config.title
source: Create Mackup config
zh_hans: 创建 Mackup 配置

# setup.config.update
source: Save config file
zh_hans: 保存配置文件

# status.checking
source: Checking...
zh_hans: 正在检查...

# status.failed
source: Failed
zh_hans: 失败

# status.not_checked
source: Not checked
zh_hans: 未检查

# status.running
source: Running
zh_hans: 运行中

# status.success
source: Success
zh_hans: 成功

# storage.config.pending
source: Config path pending
zh_hans: 配置路径待载入

# storage.directory
source: Directory
zh_hans: 目录

# storage.directory.placeholder
source: Choose the Mackup folder name
zh_hans: 选择 Mackup 文件夹名称

# storage.engine
source: Engine
zh_hans: 存储后端

# storage.failed
source: Could not load storage settings
zh_hans: 无法载入存储设置

# storage.file_system.detail
source: file_system uses path as the storage root. YAMG only writes the config; it does not migrate files.
zh_hans: file_system 使用 path 作为存储根目录。YAMG 只写配置，不迁移文件。

# storage.folder
source: Mackup folder
zh_hans: Mackup 文件夹

# storage.folder.placeholder
source: Choose a Mackup storage folder
zh_hans: 选择 Mackup 存储文件夹

# storage.path
source: Path
zh_hans: 路径

# storage.path.auto_detected
source: Dropbox, Google Drive, and iCloud paths are detected by Mackup. Choose values here only when overriding Mackup defaults.
zh_hans: Dropbox、Google Drive 和 iCloud 路径由 Mackup 检测。只有需要覆盖默认值时才在这里选择。

# storage.path.placeholder
source: Choose a storage root folder
zh_hans: 选择存储根目录

# storage.saved
source: Saved
zh_hans: 已保存

# storage.saving
source: Saving...
zh_hans: 正在保存...
